Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/sdmmc.h
/* -------- SDMMC_BDPR : (SDMMC Offset: 0x20) (R/W 32) Buffer Data Port -------- */
#define SDMMC_BDPR_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDMMC_BDPR) Buffer Data Port  Reset Value */

#define SDMMC_BDPR_BUFDATA_Pos                _UINT32_(0)                                          /* (SDMMC_BDPR) Buffer Data Position */
#define SDMMC_BDPR_BUFDATA_Msk                (_UINT32_(0xFFFFFFFF) << SDMMC_BDPR_BUFDATA_Pos)     /* (SDMMC_BDPR) Buffer Data Mask */
#define SDMMC_BDPR_BUFDATA(value)             (SDMMC_BDPR_BUFDATA_Msk & (_UINT32_(value) << SDMMC_BDPR_BUFDATA_Pos)) /* Assigment of value for BUFDATA in the SDMMC_BDPR register */
#define SDMMC_BDPR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SDMMC_BDPR) Register Mask  */


/* -------- SDMMC_PSR : (SDMMC Offset: 0x24) ( R/ 32) Present State -------- */
#define SDMMC_PSR_RESETVALUE                  _UINT32_(0xF80000)                                   /*  (SDMMC_PSR) Present State  Reset Value */

#define SDMMC_PSR_CMDINHC_Pos                 _UINT32_(0)                                          /* (SDMMC_PSR) Command Inhibit (CMD) Position */
#define SDMMC_PSR_CMDINHC_Msk                 (_UINT32_(0x1) << SDMMC_PSR_CMDINHC_Pos)             /* (SDMMC_PSR) Command Inhibit (CMD) Mask */
#define SDMMC_PSR_CMDINHC(value)              (SDMMC_PSR_CMDINHC_Msk & (_UINT32_(value) << SDMMC_PSR_CMDINHC_Pos)) /* Assigment of value for CMDINHC in the SDMMC_PSR register */
#define   SDMMC_PSR_CMDINHC_CAN_Val           _UINT32_(0x0)                                        /* (SDMMC_PSR) Can issue command using only CMD line  */
#define   SDMMC_PSR_CMDINHC_CANNOT_Val        _UINT32_(0x1)                                        /* (SDMMC_PSR) Cannot issue command  */
#define SDMMC_PSR_CMDINHC_CAN                 (SDMMC_PSR_CMDINHC_CAN_Val << SDMMC_PSR_CMDINHC_Pos) /* (SDMMC_PSR) Can issue command using only CMD line Position  */
#define SDMMC_PSR_CMDINHC_CANNOT              (SDMMC_PSR_CMDINHC_CANNOT_Val << SDMMC_PSR_CMDINHC_Pos) /* (SDMMC_PSR) Cannot issue command Position  */
#define SDMMC_PSR_CMDINHD_Pos                 _UINT32_(1)                                          /* (SDMMC_PSR) Command Inhibit (DAT) Position */
#define SDMMC_PSR_CMDINHD_Msk                 (_UINT32_(0x1) << SDMMC_PSR_CMDINHD_Pos)             /* (SDMMC_PSR) Command Inhibit (DAT) Mask */
#define SDMMC_PSR_CMDINHD(value)              (SDMMC_PSR_CMDINHD_Msk & (_UINT32_(value) << SDMMC_PSR_CMDINHD_Pos)) /* Assigment of value for CMDINHD in the SDMMC_PSR register */
#define   SDMMC_PSR_CMDINHD_CAN_Val           _UINT32_(0x0)                                        /* (SDMMC_PSR) Can issue command which uses the DAT line  */
#define   SDMMC_PSR_CMDINHD_CANNOT_Val        _UINT32_(0x1)                                        /* (SDMMC_PSR) Cannot issue command which uses the DAT line  */
#define SDMMC_PSR_CMDINHD_CAN                 (SDMMC_PSR_CMDINHD_CAN_Val << SDMMC_PSR_CMDINHD_Pos) /* (SDMMC_PSR) Can issue command which uses the DAT line Position  */
#define SDMMC_PSR_CMDINHD_CANNOT              (SDMMC_PSR_CMDINHD_CANNOT_Val << SDMMC_PSR_CMDINHD_Pos) /* (SDMMC_PSR) Cannot issue command which uses the DAT line Position  */
#define SDMMC_PSR_DLACT_Pos                   _UINT32_(2)                                          /* (SDMMC_PSR) DAT Line Active Position */
#define SDMMC_PSR_DLACT_Msk                   (_UINT32_(0x1) << SDMMC_PSR_DLACT_Pos)               /* (SDMMC_PSR) DAT Line Active Mask */
#define SDMMC_PSR_DLACT(value)                (SDMMC_PSR_DLACT_Msk & (_UINT32_(value) << SDMMC_PSR_DLACT_Pos)) /* Assigment of value for DLACT in the SDMMC_PSR register */
#define   SDMMC_PSR_DLACT_INACTIVE_Val        _UINT32_(0x0)                                        /* (SDMMC_PSR) DAT Line Inactive  */
#define   SDMMC_PSR_DLACT_ACTIVE_Val          _UINT32_(0x1)                                        /* (SDMMC_PSR) DAT Line Active  */
#define SDMMC_PSR_DLACT_INACTIVE              (SDMMC_PSR_DLACT_INACTIVE_Val << SDMMC_PSR_DLACT_Pos) /* (SDMMC_PSR) DAT Line Inactive Position  */
#define SDMMC_PSR_DLACT_ACTIVE                (SDMMC_PSR_DLACT_ACTIVE_Val << SDMMC_PSR_DLACT_Pos)  /* (SDMMC_PSR) DAT Line Active Position  */
#define SDMMC_PSR_RTREQ_Pos                   _UINT32_(3)                                          /* (SDMMC_PSR) Re-Tuning Request Position */
#define SDMMC_PSR_RTREQ_Msk                   (_UINT32_(0x1) << SDMMC_PSR_RTREQ_Pos)               /* (SDMMC_PSR) Re-Tuning Request Mask */
#define SDMMC_PSR_RTREQ(value)                (SDMMC_PSR_RTREQ_Msk & (_UINT32_(value) << SDMMC_PSR_RTREQ_Pos)) /* Assigment of value for RTREQ in the SDMMC_PSR register */
#define   SDMMC_PSR_RTREQ_OK_Val              _UINT32_(0x0)                                        /* (SDMMC_PSR) Fixed or well-tuned sampling clock  */
#define   SDMMC_PSR_RTREQ_REQUIRED_Val        _UINT32_(0x1)                                        /* (SDMMC_PSR) Sampling clock needs re-tuning  */
#define SDMMC_PSR_RTREQ_OK                    (SDMMC_PSR_RTREQ_OK_Val << SDMMC_PSR_RTREQ_Pos)      /* (SDMMC_PSR) Fixed or well-tuned sampling clock Position  */
#define SDMMC_PSR_RTREQ_REQUIRED              (SDMMC_PSR_RTREQ_REQUIRED_Val << SDMMC_PSR_RTREQ_Pos) /* (SDMMC_PSR) Sampling clock needs re-tuning Position  */
#define SDMMC_PSR_WTACT_Pos                   _UINT32_(8)                                          /* (SDMMC_PSR) Write Transfer Active Position */
#define SDMMC_PSR_WTACT_Msk                   (_UINT32_(0x1) << SDMMC_PSR_WTACT_Pos)               /* (SDMMC_PSR) Write Transfer Active Mask */
#define SDMMC_PSR_WTACT(value)                (SDMMC_PSR_WTACT_Msk & (_UINT32_(value) << SDMMC_PSR_WTACT_Pos)) /* Assigment of value for WTACT in the SDMMC_PSR register */
#define   SDMMC_PSR_WTACT_NO_Val              _UINT32_(0x0)                                        /* (SDMMC_PSR) No valid data  */
#define   SDMMC_PSR_WTACT_YES_Val             _UINT32_(0x1)                                        /* (SDMMC_PSR) Transferring data  */
#define SDMMC_PSR_WTACT_NO                    (SDMMC_PSR_WTACT_NO_Val << SDMMC_PSR_WTACT_Pos)      /* (SDMMC_PSR) No valid data Position  */
#define SDMMC_PSR_WTACT_YES                   (SDMMC_PSR_WTACT_YES_Val << SDMMC_PSR_WTACT_Pos)     /* (SDMMC_PSR) Transferring data Position  */
#define SDMMC_PSR_RTACT_Pos                   _UINT32_(9)                                          /* (SDMMC_PSR) Read Transfer Active Position */
#define SDMMC_PSR_RTACT_Msk                   (_UINT32_(0x1) << SDMMC_PSR_RTACT_Pos)               /* (SDMMC_PSR) Read Transfer Active Mask */
#define SDMMC_PSR_RTACT(value)                (SDMMC_PSR_RTACT_Msk & (_UINT32_(value) << SDMMC_PSR_RTACT_Pos)) /* Assigment of value for RTACT in the SDMMC_PSR register */
#define   SDMMC_PSR_RTACT_NO_Val              _UINT32_(0x0)                                        /* (SDMMC_PSR) No valid data  */
#define   SDMMC_PSR_RTACT_YES_Val             _UINT32_(0x1)                                        /* (SDMMC_PSR) Transferring data  */
#define SDMMC_PSR_RTACT_NO                    (SDMMC_PSR_RTACT_NO_Val << SDMMC_PSR_RTACT_Pos)      /* (SDMMC_PSR) No valid data Position  */
#define SDMMC_PSR_RTACT_YES                   (SDMMC_PSR_RTACT_YES_Val << SDMMC_PSR_RTACT_Pos)     /* (SDMMC_PSR) Transferring data Position  */
#define SDMMC_PSR_BUFWREN_Pos                 _UINT32_(10)                                         /* (SDMMC_PSR) Buffer Write Enable Position */
#define SDMMC_PSR_BUFWREN_Msk                 (_UINT32_(0x1) << SDMMC_PSR_BUFWREN_Pos)             /* (SDMMC_PSR) Buffer Write Enable Mask */
#define SDMMC_PSR_BUFWREN(value)              (SDMMC_PSR_BUFWREN_Msk & (_UINT32_(value) << SDMMC_PSR_BUFWREN_Pos)) /* Assigment of value for BUFWREN in the SDMMC_PSR register */
#define   SDMMC_PSR_BUFWREN_DISABLE_Val       _UINT32_(0x0)                                        /* (SDMMC_PSR) Write disable  */
#define   SDMMC_PSR_BUFWREN_ENABLE_Val        _UINT32_(0x1)                                        /* (SDMMC_PSR) Write enable  */
#define SDMMC_PSR_BUFWREN_DISABLE             (SDMMC_PSR_BUFWREN_DISABLE_Val << SDMMC_PSR_BUFWREN_Pos) /* (SDMMC_PSR) Write disable Position  */
#define SDMMC_PSR_BUFWREN_ENABLE              (SDMMC_PSR_BUFWREN_ENABLE_Val << SDMMC_PSR_BUFWREN_Pos) /* (SDMMC_PSR) Write enable Position  */
#define SDMMC_PSR_BUFRDEN_Pos                 _UINT32_(11)                                         /* (SDMMC_PSR) Buffer Read Enable Position */
#define SDMMC_PSR_BUFRDEN_Msk                 (_UINT32_(0x1) << SDMMC_PSR_BUFRDEN_Pos)             /* (SDMMC_PSR) Buffer Read Enable Mask */
#define SDMMC_PSR_BUFRDEN(value)              (SDMMC_PSR_BUFRDEN_Msk & (_UINT32_(value) << SDMMC_PSR_BUFRDEN_Pos)) /* Assigment of value for BUFRDEN in the SDMMC_PSR register */
#define   SDMMC_PSR_BUFRDEN_DISABLE_Val       _UINT32_(0x0)                                        /* (SDMMC_PSR) Read disable  */
#define   SDMMC_PSR_BUFRDEN_ENABLE_Val        _UINT32_(0x1)                                        /* (SDMMC_PSR) Read enable  */
#define SDMMC_PSR_BUFRDEN_DISABLE             (SDMMC_PSR_BUFRDEN_DISABLE_Val << SDMMC_PSR_BUFRDEN_Pos) /* (SDMMC_PSR) Read disable Position  */
#define SDMMC_PSR_BUFRDEN_ENABLE              (SDMMC_PSR_BUFRDEN_ENABLE_Val << SDMMC_PSR_BUFRDEN_Pos) /* (SDMMC_PSR) Read enable Position  */
#define SDMMC_PSR_CARDINS_Pos                 _UINT32_(16)                                         /* (SDMMC_PSR) Card Inserted Position */
#define SDMMC_PSR_CARDINS_Msk                 (_UINT32_(0x1) << SDMMC_PSR_CARDINS_Pos)             /* (SDMMC_PSR) Card Inserted Mask */
#define SDMMC_PSR_CARDINS(value)              (SDMMC_PSR_CARDINS_Msk & (_UINT32_(value) << SDMMC_PSR_CARDINS_Pos)) /* Assigment of value for CARDINS in the SDMMC_PSR register */
#define   SDMMC_PSR_CARDINS_NO_Val            _UINT32_(0x0)                                        /* (SDMMC_PSR) Reset or Debouncing or No Card  */
#define   SDMMC_PSR_CARDINS_YES_Val           _UINT32_(0x1)                                        /* (SDMMC_PSR) Card inserted  */
#define SDMMC_PSR_CARDINS_NO                  (SDMMC_PSR_CARDINS_NO_Val << SDMMC_PSR_CARDINS_Pos)  /* (SDMMC_PSR) Reset or Debouncing or No Card Position  */
#define SDMMC_PSR_CARDINS_YES                 (SDMMC_PSR_CARDINS_YES_Val << SDMMC_PSR_CARDINS_Pos) /* (SDMMC_PSR) Card inserted Position  */
#define SDMMC_PSR_CARDSS_Pos                  _UINT32_(17)                                         /* (SDMMC_PSR) Card State Stable Position */
#define SDMMC_PSR_CARDSS_Msk                  (_UINT32_(0x1) << SDMMC_PSR_CARDSS_Pos)              /* (SDMMC_PSR) Card State Stable Mask */
#define SDMMC_PSR_CARDSS(value)               (SDMMC_PSR_CARDSS_Msk & (_UINT32_(value) << SDMMC_PSR_CARDSS_Pos)) /* Assigment of value for CARDSS in the SDMMC_PSR register */
#define   SDMMC_PSR_CARDSS_NO_Val             _UINT32_(0x0)                                        /* (SDMMC_PSR) Reset or Debouncing  */
#define   SDMMC_PSR_CARDSS_YES_Val            _UINT32_(0x1)                                        /* (SDMMC_PSR) No Card or Insered  */
#define SDMMC_PSR_CARDSS_NO                   (SDMMC_PSR_CARDSS_NO_Val << SDMMC_PSR_CARDSS_Pos)    /* (SDMMC_PSR) Reset or Debouncing Position  */
#define SDMMC_PSR_CARDSS_YES                  (SDMMC_PSR_CARDSS_YES_Val << SDMMC_PSR_CARDSS_Pos)   /* (SDMMC_PSR) No Card or Insered Position  */
#define SDMMC_PSR_CARDDPL_Pos                 _UINT32_(18)                                         /* (SDMMC_PSR) Card Detect Pin Level Position */
#define SDMMC_PSR_CARDDPL_Msk                 (_UINT32_(0x1) << SDMMC_PSR_CARDDPL_Pos)             /* (SDMMC_PSR) Card Detect Pin Level Mask */
#define SDMMC_PSR_CARDDPL(value)              (SDMMC_PSR_CARDDPL_Msk & (_UINT32_(value) << SDMMC_PSR_CARDDPL_Pos)) /* Assigment of value for CARDDPL in the SDMMC_PSR register */
#define   SDMMC_PSR_CARDDPL_NO_Val            _UINT32_(0x0)                                        /* (SDMMC_PSR) No card present (SDCD#=1)  */
#define   SDMMC_PSR_CARDDPL_YES_Val           _UINT32_(0x1)                                        /* (SDMMC_PSR) Card present (SDCD#=0)  */
#define SDMMC_PSR_CARDDPL_NO                  (SDMMC_PSR_CARDDPL_NO_Val << SDMMC_PSR_CARDDPL_Pos)  /* (SDMMC_PSR) No card present (SDCD#=1) Position  */
#define SDMMC_PSR_CARDDPL_YES                 (SDMMC_PSR_CARDDPL_YES_Val << SDMMC_PSR_CARDDPL_Pos) /* (SDMMC_PSR) Card present (SDCD#=0) Position  */
#define SDMMC_PSR_WRPPL_Pos                   _UINT32_(19)                                         /* (SDMMC_PSR) Write Protect Pin Level Position */
#define SDMMC_PSR_WRPPL_Msk                   (_UINT32_(0x1) << SDMMC_PSR_WRPPL_Pos)               /* (SDMMC_PSR) Write Protect Pin Level Mask */
#define SDMMC_PSR_WRPPL(value)                (SDMMC_PSR_WRPPL_Msk & (_UINT32_(value) << SDMMC_PSR_WRPPL_Pos)) /* Assigment of value for WRPPL in the SDMMC_PSR register */
#define   SDMMC_PSR_WRPPL_PROTECTED_Val       _UINT32_(0x0)                                        /* (SDMMC_PSR) Write protected (SDWP#=0)  */
#define   SDMMC_PSR_WRPPL_ENABLED_Val         _UINT32_(0x1)                                        /* (SDMMC_PSR) Write enabled (SDWP#=1)  */
#define SDMMC_PSR_WRPPL_PROTECTED             (SDMMC_PSR_WRPPL_PROTECTED_Val << SDMMC_PSR_WRPPL_Pos) /* (SDMMC_PSR) Write protected (SDWP#=0) Position  */
#define SDMMC_PSR_WRPPL_ENABLED               (SDMMC_PSR_WRPPL_ENABLED_Val << SDMMC_PSR_WRPPL_Pos) /* (SDMMC_PSR) Write enabled (SDWP#=1) Position  */
#define SDMMC_PSR_DATLL_Pos                   _UINT32_(20)                                         /* (SDMMC_PSR) DAT[3:0] Line Level Position */
#define SDMMC_PSR_DATLL_Msk                   (_UINT32_(0xF) << SDMMC_PSR_DATLL_Pos)               /* (SDMMC_PSR) DAT[3:0] Line Level Mask */
#define SDMMC_PSR_DATLL(value)                (SDMMC_PSR_DATLL_Msk & (_UINT32_(value) << SDMMC_PSR_DATLL_Pos)) /* Assigment of value for DATLL in the SDMMC_PSR register */
#define SDMMC_PSR_CMDLL_Pos                   _UINT32_(24)                                         /* (SDMMC_PSR) CMD Line Level Position */
#define SDMMC_PSR_CMDLL_Msk                   (_UINT32_(0x1) << SDMMC_PSR_CMDLL_Pos)               /* (SDMMC_PSR) CMD Line Level Mask */
#define SDMMC_PSR_CMDLL(value)                (SDMMC_PSR_CMDLL_Msk & (_UINT32_(value) << SDMMC_PSR_CMDLL_Pos)) /* Assigment of value for CMDLL in the SDMMC_PSR register */
#define SDMMC_PSR_Msk                         _UINT32_(0x01FF0F0F)                                 /* (SDMMC_PSR) Register Mask  */


/* -------- SDMMC_HC1R : (SDMMC Offset: 0x28) (R/W 8) Host Control 1 -------- */
#define SDMMC_HC1R_RESETVALUE                 _UINT8_(0x00)                                        /*  (SDMMC_HC1R) Host Control 1  Reset Value */

#define SDMMC_HC1R_LEDCTRL_Pos                _UINT8_(0)                                           /* (SDMMC_HC1R) LED Control Position */
#define SDMMC_HC1R_LEDCTRL_Msk                (_UINT8_(0x1) << SDMMC_HC1R_LEDCTRL_Pos)             /* (SDMMC_HC1R) LED Control Mask */
#define SDMMC_HC1R_LEDCTRL(value)             (SDMMC_HC1R_LEDCTRL_Msk & (_UINT8_(value) << SDMMC_HC1R_LEDCTRL_Pos)) /* Assigment of value for LEDCTRL in the SDMMC_HC1R register */
#define   SDMMC_HC1R_LEDCTRL_OFF_Val          _UINT8_(0x0)                                         /* (SDMMC_HC1R) LED off  */
#define   SDMMC_HC1R_LEDCTRL_ON_Val           _UINT8_(0x1)                                         /* (SDMMC_HC1R) LED on  */
#define SDMMC_HC1R_LEDCTRL_OFF                (SDMMC_HC1R_LEDCTRL_OFF_Val << SDMMC_HC1R_LEDCTRL_Pos) /* (SDMMC_HC1R) LED off Position  */
#define SDMMC_HC1R_LEDCTRL_ON                 (SDMMC_HC1R_LEDCTRL_ON_Val << SDMMC_HC1R_LEDCTRL_Pos) /* (SDMMC_HC1R) LED on Position  */
#define SDMMC_HC1R_DW_Pos                     _UINT8_(1)                                           /* (SDMMC_HC1R) Data Width Position */
#define SDMMC_HC1R_DW_Msk                     (_UINT8_(0x1) << SDMMC_HC1R_DW_Pos)                  /* (SDMMC_HC1R) Data Width Mask */
#define SDMMC_HC1R_DW(value)                  (SDMMC_HC1R_DW_Msk & (_UINT8_(value) << SDMMC_HC1R_DW_Pos)) /* Assigment of value for DW in the SDMMC_HC1R register */
#define   SDMMC_HC1R_DW_1BIT_Val              _UINT8_(0x0)                                         /* (SDMMC_HC1R) 1-bit mode  */
#define   SDMMC_HC1R_DW_4BIT_Val              _UINT8_(0x1)                                         /* (SDMMC_HC1R) 4-bit mode  */
#define SDMMC_HC1R_DW_1BIT                    (SDMMC_HC1R_DW_1BIT_Val << SDMMC_HC1R_DW_Pos)        /* (SDMMC_HC1R) 1-bit mode Position  */
#define SDMMC_HC1R_DW_4BIT                    (SDMMC_HC1R_DW_4BIT_Val << SDMMC_HC1R_DW_Pos)        /* (SDMMC_HC1R) 4-bit mode Position  */
#define SDMMC_HC1R_HSEN_Pos                   _UINT8_(2)                                           /* (SDMMC_HC1R) High Speed Enable Position */
#define SDMMC_HC1R_HSEN_Msk                   (_UINT8_(0x1) << SDMMC_HC1R_HSEN_Pos)                /* (SDMMC_HC1R) High Speed Enable Mask */
#define SDMMC_HC1R_HSEN(value)                (SDMMC_HC1R_HSEN_Msk & (_UINT8_(value) << SDMMC_HC1R_HSEN_Pos)) /* Assigment of value for HSEN in the SDMMC_HC1R register */
#define   SDMMC_HC1R_HSEN_NORMAL_Val          _UINT8_(0x0)                                         /* (SDMMC_HC1R) Normal Speed mode  */
#define   SDMMC_HC1R_HSEN_HIGH_Val            _UINT8_(0x1)                                         /* (SDMMC_HC1R) High Speed mode  */
#define SDMMC_HC1R_HSEN_NORMAL                (SDMMC_HC1R_HSEN_NORMAL_Val << SDMMC_HC1R_HSEN_Pos)  /* (SDMMC_HC1R) Normal Speed mode Position  */
#define SDMMC_HC1R_HSEN_HIGH                  (SDMMC_HC1R_HSEN_HIGH_Val << SDMMC_HC1R_HSEN_Pos)    /* (SDMMC_HC1R) High Speed mode Position  */
#define SDMMC_HC1R_DMASEL_Pos                 _UINT8_(3)                                           /* (SDMMC_HC1R) DMA Select Position */
#define SDMMC_HC1R_DMASEL_Msk                 (_UINT8_(0x3) << SDMMC_HC1R_DMASEL_Pos)              /* (SDMMC_HC1R) DMA Select Mask */
#define SDMMC_HC1R_DMASEL(value)              (SDMMC_HC1R_DMASEL_Msk & (_UINT8_(value) << SDMMC_HC1R_DMASEL_Pos)) /* Assigment of value for DMASEL in the SDMMC_HC1R register */
#define   SDMMC_HC1R_DMASEL_SDMA_Val          _UINT8_(0x0)                                         /* (SDMMC_HC1R) SDMA is selected  */
#define   SDMMC_HC1R_DMASEL_32BIT_Val         _UINT8_(0x2)                                         /* (SDMMC_HC1R) 32-bit Address ADMA2 is selected  */
#define SDMMC_HC1R_DMASEL_SDMA                (SDMMC_HC1R_DMASEL_SDMA_Val << SDMMC_HC1R_DMASEL_Pos) /* (SDMMC_HC1R) SDMA is selected Position  */
#define SDMMC_HC1R_DMASEL_32BIT               (SDMMC_HC1R_DMASEL_32BIT_Val << SDMMC_HC1R_DMASEL_Pos) /* (SDMMC_HC1R) 32-bit Address ADMA2 is selected Position  */
#define SDMMC_HC1R_CARDDTL_Pos                _UINT8_(6)                                           /* (SDMMC_HC1R) Card Detect Test Level Position */
#define SDMMC_HC1R_CARDDTL_Msk                (_UINT8_(0x1) << SDMMC_HC1R_CARDDTL_Pos)             /* (SDMMC_HC1R) Card Detect Test Level Mask */
#define SDMMC_HC1R_CARDDTL(value)             (SDMMC_HC1R_CARDDTL_Msk & (_UINT8_(value) << SDMMC_HC1R_CARDDTL_Pos)) /* Assigment of value for CARDDTL in the SDMMC_HC1R register */
#define   SDMMC_HC1R_CARDDTL_NO_Val           _UINT8_(0x0)                                         /* (SDMMC_HC1R) No Card  */
#define   SDMMC_HC1R_CARDDTL_YES_Val          _UINT8_(0x1)                                         /* (SDMMC_HC1R) Card Inserted  */
#define SDMMC_HC1R_CARDDTL_NO                 (SDMMC_HC1R_CARDDTL_NO_Val << SDMMC_HC1R_CARDDTL_Pos) /* (SDMMC_HC1R) No Card Position  */
#define SDMMC_HC1R_CARDDTL_YES                (SDMMC_HC1R_CARDDTL_YES_Val << SDMMC_HC1R_CARDDTL_Pos) /* (SDMMC_HC1R) Card Inserted Position  */
#define SDMMC_HC1R_CARDDSEL_Pos               _UINT8_(7)                                           /* (SDMMC_HC1R) Card Detect Signal Selection Position */
#define SDMMC_HC1R_CARDDSEL_Msk               (_UINT8_(0x1) << SDMMC_HC1R_CARDDSEL_Pos)            /* (SDMMC_HC1R) Card Detect Signal Selection Mask */
#define SDMMC_HC1R_CARDDSEL(value)            (SDMMC_HC1R_CARDDSEL_Msk & (_UINT8_(value) << SDMMC_HC1R_CARDDSEL_Pos)) /* Assigment of value for CARDDSEL in the SDMMC_HC1R register */
#define   SDMMC_HC1R_CARDDSEL_NORMAL_Val      _UINT8_(0x0)                                         /* (SDMMC_HC1R) SDCD# is selected (for normal use)  */
#define   SDMMC_HC1R_CARDDSEL_TEST_Val        _UINT8_(0x1)                                         /* (SDMMC_HC1R) The Card Select Test Level is selected (for test purpose)  */
#define SDMMC_HC1R_CARDDSEL_NORMAL            (SDMMC_HC1R_CARDDSEL_NORMAL_Val << SDMMC_HC1R_CARDDSEL_Pos) /* (SDMMC_HC1R) SDCD# is selected (for normal use) Position  */
#define SDMMC_HC1R_CARDDSEL_TEST              (SDMMC_HC1R_CARDDSEL_TEST_Val << SDMMC_HC1R_CARDDSEL_Pos) /* (SDMMC_HC1R) The Card Select Test Level is selected (for test purpose) Position  */
#define SDMMC_HC1R_Msk                        _UINT8_(0xDF)                                        /* (SDMMC_HC1R) Register Mask  */

/* EMMC mode */
#define SDMMC_HC1R_EMMC_Msk                   _UINT8_(0x00)                                         /* (SDMMC_HC1R_EMMC) Register Mask  */


