Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/sdmmc.h
#define SDMMC_CA1R_SDR50SUP_Pos               _UINT32_(0)                                          /* (SDMMC_CA1R) SDR50 Support Position */
#define SDMMC_CA1R_SDR50SUP_Msk               (_UINT32_(0x1) << SDMMC_CA1R_SDR50SUP_Pos)           /* (SDMMC_CA1R) SDR50 Support Mask */
#define SDMMC_CA1R_SDR50SUP(value)            (SDMMC_CA1R_SDR50SUP_Msk & (_UINT32_(value) << SDMMC_CA1R_SDR50SUP_Pos)) /* Assigment of value for SDR50SUP in the SDMMC_CA1R register */
#define   SDMMC_CA1R_SDR50SUP_NO_Val          _UINT32_(0x0)                                        /* (SDMMC_CA1R) SDR50 is Not Supported  */
#define   SDMMC_CA1R_SDR50SUP_YES_Val         _UINT32_(0x1)                                        /* (SDMMC_CA1R) SDR50 is Supported  */
#define SDMMC_CA1R_SDR50SUP_NO                (SDMMC_CA1R_SDR50SUP_NO_Val << SDMMC_CA1R_SDR50SUP_Pos) /* (SDMMC_CA1R) SDR50 is Not Supported Position  */
#define SDMMC_CA1R_SDR50SUP_YES               (SDMMC_CA1R_SDR50SUP_YES_Val << SDMMC_CA1R_SDR50SUP_Pos) /* (SDMMC_CA1R) SDR50 is Supported Position  */
#define SDMMC_CA1R_SDR104SUP_Pos              _UINT32_(1)                                          /* (SDMMC_CA1R) SDR104 Support Position */
#define SDMMC_CA1R_SDR104SUP_Msk              (_UINT32_(0x1) << SDMMC_CA1R_SDR104SUP_Pos)          /* (SDMMC_CA1R) SDR104 Support Mask */
#define SDMMC_CA1R_SDR104SUP(value)           (SDMMC_CA1R_SDR104SUP_Msk & (_UINT32_(value) << SDMMC_CA1R_SDR104SUP_Pos)) /* Assigment of value for SDR104SUP in the SDMMC_CA1R register */
#define   SDMMC_CA1R_SDR104SUP_NO_Val         _UINT32_(0x0)                                        /* (SDMMC_CA1R) SDR104 is Not Supported  */
#define   SDMMC_CA1R_SDR104SUP_YES_Val        _UINT32_(0x1)                                        /* (SDMMC_CA1R) SDR104 is Supported  */
#define SDMMC_CA1R_SDR104SUP_NO               (SDMMC_CA1R_SDR104SUP_NO_Val << SDMMC_CA1R_SDR104SUP_Pos) /* (SDMMC_CA1R) SDR104 is Not Supported Position  */
#define SDMMC_CA1R_SDR104SUP_YES              (SDMMC_CA1R_SDR104SUP_YES_Val << SDMMC_CA1R_SDR104SUP_Pos) /* (SDMMC_CA1R) SDR104 is Supported Position  */
#define SDMMC_CA1R_DDR50SUP_Pos               _UINT32_(2)                                          /* (SDMMC_CA1R) DDR50 Support Position */
#define SDMMC_CA1R_DDR50SUP_Msk               (_UINT32_(0x1) << SDMMC_CA1R_DDR50SUP_Pos)           /* (SDMMC_CA1R) DDR50 Support Mask */
#define SDMMC_CA1R_DDR50SUP(value)            (SDMMC_CA1R_DDR50SUP_Msk & (_UINT32_(value) << SDMMC_CA1R_DDR50SUP_Pos)) /* Assigment of value for DDR50SUP in the SDMMC_CA1R register */
#define   SDMMC_CA1R_DDR50SUP_NO_Val          _UINT32_(0x0)                                        /* (SDMMC_CA1R) DDR50 is Not Supported  */
#define   SDMMC_CA1R_DDR50SUP_YES_Val         _UINT32_(0x1)                                        /* (SDMMC_CA1R) DDR50 is Supported  */
#define SDMMC_CA1R_DDR50SUP_NO                (SDMMC_CA1R_DDR50SUP_NO_Val << SDMMC_CA1R_DDR50SUP_Pos) /* (SDMMC_CA1R) DDR50 is Not Supported Position  */
#define SDMMC_CA1R_DDR50SUP_YES               (SDMMC_CA1R_DDR50SUP_YES_Val << SDMMC_CA1R_DDR50SUP_Pos) /* (SDMMC_CA1R) DDR50 is Supported Position  */
#define SDMMC_CA1R_DRVASUP_Pos                _UINT32_(4)                                          /* (SDMMC_CA1R) Driver Type A Support Position */
#define SDMMC_CA1R_DRVASUP_Msk                (_UINT32_(0x1) << SDMMC_CA1R_DRVASUP_Pos)            /* (SDMMC_CA1R) Driver Type A Support Mask */
#define SDMMC_CA1R_DRVASUP(value)             (SDMMC_CA1R_DRVASUP_Msk & (_UINT32_(value) << SDMMC_CA1R_DRVASUP_Pos)) /* Assigment of value for DRVASUP in the SDMMC_CA1R register */
#define   SDMMC_CA1R_DRVASUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA1R) Driver Type A is Not Supported  */
#define   SDMMC_CA1R_DRVASUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA1R) Driver Type A is Supported  */
#define SDMMC_CA1R_DRVASUP_NO                 (SDMMC_CA1R_DRVASUP_NO_Val << SDMMC_CA1R_DRVASUP_Pos) /* (SDMMC_CA1R) Driver Type A is Not Supported Position  */
#define SDMMC_CA1R_DRVASUP_YES                (SDMMC_CA1R_DRVASUP_YES_Val << SDMMC_CA1R_DRVASUP_Pos) /* (SDMMC_CA1R) Driver Type A is Supported Position  */
#define SDMMC_CA1R_DRVCSUP_Pos                _UINT32_(5)                                          /* (SDMMC_CA1R) Driver Type C Support Position */
#define SDMMC_CA1R_DRVCSUP_Msk                (_UINT32_(0x1) << SDMMC_CA1R_DRVCSUP_Pos)            /* (SDMMC_CA1R) Driver Type C Support Mask */
#define SDMMC_CA1R_DRVCSUP(value)             (SDMMC_CA1R_DRVCSUP_Msk & (_UINT32_(value) << SDMMC_CA1R_DRVCSUP_Pos)) /* Assigment of value for DRVCSUP in the SDMMC_CA1R register */
#define   SDMMC_CA1R_DRVCSUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA1R) Driver Type C is Not Supported  */
#define   SDMMC_CA1R_DRVCSUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA1R) Driver Type C is Supported  */
#define SDMMC_CA1R_DRVCSUP_NO                 (SDMMC_CA1R_DRVCSUP_NO_Val << SDMMC_CA1R_DRVCSUP_Pos) /* (SDMMC_CA1R) Driver Type C is Not Supported Position  */
#define SDMMC_CA1R_DRVCSUP_YES                (SDMMC_CA1R_DRVCSUP_YES_Val << SDMMC_CA1R_DRVCSUP_Pos) /* (SDMMC_CA1R) Driver Type C is Supported Position  */
#define SDMMC_CA1R_DRVDSUP_Pos                _UINT32_(6)                                          /* (SDMMC_CA1R) Driver Type D Support Position */
#define SDMMC_CA1R_DRVDSUP_Msk                (_UINT32_(0x1) << SDMMC_CA1R_DRVDSUP_Pos)            /* (SDMMC_CA1R) Driver Type D Support Mask */
#define SDMMC_CA1R_DRVDSUP(value)             (SDMMC_CA1R_DRVDSUP_Msk & (_UINT32_(value) << SDMMC_CA1R_DRVDSUP_Pos)) /* Assigment of value for DRVDSUP in the SDMMC_CA1R register */
#define   SDMMC_CA1R_DRVDSUP_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA1R) Driver Type D is Not Supported  */
#define   SDMMC_CA1R_DRVDSUP_YES_Val          _UINT32_(0x1)                                        /* (SDMMC_CA1R) Driver Type D is Supported  */
#define SDMMC_CA1R_DRVDSUP_NO                 (SDMMC_CA1R_DRVDSUP_NO_Val << SDMMC_CA1R_DRVDSUP_Pos) /* (SDMMC_CA1R) Driver Type D is Not Supported Position  */
#define SDMMC_CA1R_DRVDSUP_YES                (SDMMC_CA1R_DRVDSUP_YES_Val << SDMMC_CA1R_DRVDSUP_Pos) /* (SDMMC_CA1R) Driver Type D is Supported Position  */
#define SDMMC_CA1R_TCNTRT_Pos                 _UINT32_(8)                                          /* (SDMMC_CA1R) Timer Count for Re-Tuning Position */
#define SDMMC_CA1R_TCNTRT_Msk                 (_UINT32_(0xF) << SDMMC_CA1R_TCNTRT_Pos)             /* (SDMMC_CA1R) Timer Count for Re-Tuning Mask */
#define SDMMC_CA1R_TCNTRT(value)              (SDMMC_CA1R_TCNTRT_Msk & (_UINT32_(value) << SDMMC_CA1R_TCNTRT_Pos)) /* Assigment of value for TCNTRT in the SDMMC_CA1R register */
#define   SDMMC_CA1R_TCNTRT_DISABLED_Val      _UINT32_(0x0)                                        /* (SDMMC_CA1R) Re-Tuning Timer disabled  */
#define   SDMMC_CA1R_TCNTRT_1S_Val            _UINT32_(0x1)                                        /* (SDMMC_CA1R) 1 second  */
#define   SDMMC_CA1R_TCNTRT_2S_Val            _UINT32_(0x2)                                        /* (SDMMC_CA1R) 2 seconds  */
#define   SDMMC_CA1R_TCNTRT_4S_Val            _UINT32_(0x3)                                        /* (SDMMC_CA1R) 4 seconds  */
#define   SDMMC_CA1R_TCNTRT_8S_Val            _UINT32_(0x4)                                        /* (SDMMC_CA1R) 8 seconds  */
#define   SDMMC_CA1R_TCNTRT_16S_Val           _UINT32_(0x5)                                        /* (SDMMC_CA1R) 16 seconds  */
#define   SDMMC_CA1R_TCNTRT_32S_Val           _UINT32_(0x6)                                        /* (SDMMC_CA1R) 32 seconds  */
#define   SDMMC_CA1R_TCNTRT_64S_Val           _UINT32_(0x7)                                        /* (SDMMC_CA1R) 64 seconds  */
#define   SDMMC_CA1R_TCNTRT_128S_Val          _UINT32_(0x8)                                        /* (SDMMC_CA1R) 128 seconds  */
#define   SDMMC_CA1R_TCNTRT_256S_Val          _UINT32_(0x9)                                        /* (SDMMC_CA1R) 256 seconds  */
#define   SDMMC_CA1R_TCNTRT_512S_Val          _UINT32_(0xA)                                        /* (SDMMC_CA1R) 512 seconds  */
#define   SDMMC_CA1R_TCNTRT_1024S_Val         _UINT32_(0xB)                                        /* (SDMMC_CA1R) 1024 seconds  */
#define   SDMMC_CA1R_TCNTRT_OTHER_Val         _UINT32_(0xF)                                        /* (SDMMC_CA1R) Get information from other source  */
#define SDMMC_CA1R_TCNTRT_DISABLED            (SDMMC_CA1R_TCNTRT_DISABLED_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) Re-Tuning Timer disabled Position  */
#define SDMMC_CA1R_TCNTRT_1S                  (SDMMC_CA1R_TCNTRT_1S_Val << SDMMC_CA1R_TCNTRT_Pos)  /* (SDMMC_CA1R) 1 second Position  */
#define SDMMC_CA1R_TCNTRT_2S                  (SDMMC_CA1R_TCNTRT_2S_Val << SDMMC_CA1R_TCNTRT_Pos)  /* (SDMMC_CA1R) 2 seconds Position  */
#define SDMMC_CA1R_TCNTRT_4S                  (SDMMC_CA1R_TCNTRT_4S_Val << SDMMC_CA1R_TCNTRT_Pos)  /* (SDMMC_CA1R) 4 seconds Position  */
#define SDMMC_CA1R_TCNTRT_8S                  (SDMMC_CA1R_TCNTRT_8S_Val << SDMMC_CA1R_TCNTRT_Pos)  /* (SDMMC_CA1R) 8 seconds Position  */
#define SDMMC_CA1R_TCNTRT_16S                 (SDMMC_CA1R_TCNTRT_16S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 16 seconds Position  */
#define SDMMC_CA1R_TCNTRT_32S                 (SDMMC_CA1R_TCNTRT_32S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 32 seconds Position  */
#define SDMMC_CA1R_TCNTRT_64S                 (SDMMC_CA1R_TCNTRT_64S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 64 seconds Position  */
#define SDMMC_CA1R_TCNTRT_128S                (SDMMC_CA1R_TCNTRT_128S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 128 seconds Position  */
#define SDMMC_CA1R_TCNTRT_256S                (SDMMC_CA1R_TCNTRT_256S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 256 seconds Position  */
#define SDMMC_CA1R_TCNTRT_512S                (SDMMC_CA1R_TCNTRT_512S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 512 seconds Position  */
#define SDMMC_CA1R_TCNTRT_1024S               (SDMMC_CA1R_TCNTRT_1024S_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) 1024 seconds Position  */
#define SDMMC_CA1R_TCNTRT_OTHER               (SDMMC_CA1R_TCNTRT_OTHER_Val << SDMMC_CA1R_TCNTRT_Pos) /* (SDMMC_CA1R) Get information from other source Position  */
#define SDMMC_CA1R_TSDR50_Pos                 _UINT32_(13)                                         /* (SDMMC_CA1R) Use Tuning for SDR50 Position */
#define SDMMC_CA1R_TSDR50_Msk                 (_UINT32_(0x1) << SDMMC_CA1R_TSDR50_Pos)             /* (SDMMC_CA1R) Use Tuning for SDR50 Mask */
#define SDMMC_CA1R_TSDR50(value)              (SDMMC_CA1R_TSDR50_Msk & (_UINT32_(value) << SDMMC_CA1R_TSDR50_Pos)) /* Assigment of value for TSDR50 in the SDMMC_CA1R register */
#define   SDMMC_CA1R_TSDR50_NO_Val            _UINT32_(0x0)                                        /* (SDMMC_CA1R) SDR50 does not require tuning  */
#define   SDMMC_CA1R_TSDR50_YES_Val           _UINT32_(0x1)                                        /* (SDMMC_CA1R) SDR50 requires tuning  */
#define SDMMC_CA1R_TSDR50_NO                  (SDMMC_CA1R_TSDR50_NO_Val << SDMMC_CA1R_TSDR50_Pos)  /* (SDMMC_CA1R) SDR50 does not require tuning Position  */
#define SDMMC_CA1R_TSDR50_YES                 (SDMMC_CA1R_TSDR50_YES_Val << SDMMC_CA1R_TSDR50_Pos) /* (SDMMC_CA1R) SDR50 requires tuning Position  */
#define SDMMC_CA1R_CLKMULT_Pos                _UINT32_(16)                                         /* (SDMMC_CA1R) Clock Multiplier Position */
#define SDMMC_CA1R_CLKMULT_Msk                (_UINT32_(0xFF) << SDMMC_CA1R_CLKMULT_Pos)           /* (SDMMC_CA1R) Clock Multiplier Mask */
#define SDMMC_CA1R_CLKMULT(value)             (SDMMC_CA1R_CLKMULT_Msk & (_UINT32_(value) << SDMMC_CA1R_CLKMULT_Pos)) /* Assigment of value for CLKMULT in the SDMMC_CA1R register */
#define   SDMMC_CA1R_CLKMULT_NO_Val           _UINT32_(0x0)                                        /* (SDMMC_CA1R) Clock Multiplier is Not Supported  */
#define SDMMC_CA1R_CLKMULT_NO                 (SDMMC_CA1R_CLKMULT_NO_Val << SDMMC_CA1R_CLKMULT_Pos) /* (SDMMC_CA1R) Clock Multiplier is Not Supported Position  */
#define SDMMC_CA1R_Msk                        _UINT32_(0x00FF2F77)                                 /* (SDMMC_CA1R) Register Mask  */

#define SDMMC_CA1R_TSDR_Pos                   _UINT32_(13)                                         /* (SDMMC_CA1R Position) Use Tuning for SDR5x */
#define SDMMC_CA1R_TSDR_Msk                   (_UINT32_(0x1) << SDMMC_CA1R_TSDR_Pos)               /* (SDMMC_CA1R Mask) TSDR */
#define SDMMC_CA1R_TSDR(value)                (SDMMC_CA1R_TSDR_Msk & (_UINT32_(value) << SDMMC_CA1R_TSDR_Pos)) 

/* -------- SDMMC_MCCAR : (SDMMC Offset: 0x48) ( R/ 32) Maximum Current Capabilities -------- */
#define SDMMC_MCCAR_RESETVALUE                _UINT32_(0x00)                                       /*  (SDMMC_MCCAR) Maximum Current Capabilities  Reset Value */

#define SDMMC_MCCAR_MAXCUR33V_Pos             _UINT32_(0)                                          /* (SDMMC_MCCAR) Maximum Current for 3.3V Position */
#define SDMMC_MCCAR_MAXCUR33V_Msk             (_UINT32_(0xFF) << SDMMC_MCCAR_MAXCUR33V_Pos)        /* (SDMMC_MCCAR) Maximum Current for 3.3V Mask */
#define SDMMC_MCCAR_MAXCUR33V(value)          (SDMMC_MCCAR_MAXCUR33V_Msk & (_UINT32_(value) << SDMMC_MCCAR_MAXCUR33V_Pos)) /* Assigment of value for MAXCUR33V in the SDMMC_MCCAR register */
#define   SDMMC_MCCAR_MAXCUR33V_OTHER_Val     _UINT32_(0x0)                                        /* (SDMMC_MCCAR) Get information via another method  */
#define   SDMMC_MCCAR_MAXCUR33V_4MA_Val       _UINT32_(0x1)                                        /* (SDMMC_MCCAR) 4mA  */
#define   SDMMC_MCCAR_MAXCUR33V_8MA_Val       _UINT32_(0x2)                                        /* (SDMMC_MCCAR) 8mA  */
#define   SDMMC_MCCAR_MAXCUR33V_12MA_Val      _UINT32_(0x3)                                        /* (SDMMC_MCCAR) 12mA  */
#define SDMMC_MCCAR_MAXCUR33V_OTHER           (SDMMC_MCCAR_MAXCUR33V_OTHER_Val << SDMMC_MCCAR_MAXCUR33V_Pos) /* (SDMMC_MCCAR) Get information via another method Position  */
#define SDMMC_MCCAR_MAXCUR33V_4MA             (SDMMC_MCCAR_MAXCUR33V_4MA_Val << SDMMC_MCCAR_MAXCUR33V_Pos) /* (SDMMC_MCCAR) 4mA Position  */
#define SDMMC_MCCAR_MAXCUR33V_8MA             (SDMMC_MCCAR_MAXCUR33V_8MA_Val << SDMMC_MCCAR_MAXCUR33V_Pos) /* (SDMMC_MCCAR) 8mA Position  */
#define SDMMC_MCCAR_MAXCUR33V_12MA            (SDMMC_MCCAR_MAXCUR33V_12MA_Val << SDMMC_MCCAR_MAXCUR33V_Pos) /* (SDMMC_MCCAR) 12mA Position  */
#define SDMMC_MCCAR_MAXCUR30V_Pos             _UINT32_(8)                                          /* (SDMMC_MCCAR) Maximum Current for 3.0V Position */
#define SDMMC_MCCAR_MAXCUR30V_Msk             (_UINT32_(0xFF) << SDMMC_MCCAR_MAXCUR30V_Pos)        /* (SDMMC_MCCAR) Maximum Current for 3.0V Mask */
#define SDMMC_MCCAR_MAXCUR30V(value)          (SDMMC_MCCAR_MAXCUR30V_Msk & (_UINT32_(value) << SDMMC_MCCAR_MAXCUR30V_Pos)) /* Assigment of value for MAXCUR30V in the SDMMC_MCCAR register */
#define   SDMMC_MCCAR_MAXCUR30V_OTHER_Val     _UINT32_(0x0)                                        /* (SDMMC_MCCAR) Get information via another method  */
#define   SDMMC_MCCAR_MAXCUR30V_4MA_Val       _UINT32_(0x1)                                        /* (SDMMC_MCCAR) 4mA  */
#define   SDMMC_MCCAR_MAXCUR30V_8MA_Val       _UINT32_(0x2)                                        /* (SDMMC_MCCAR) 8mA  */
#define   SDMMC_MCCAR_MAXCUR30V_12MA_Val      _UINT32_(0x3)                                        /* (SDMMC_MCCAR) 12mA  */
#define SDMMC_MCCAR_MAXCUR30V_OTHER           (SDMMC_MCCAR_MAXCUR30V_OTHER_Val << SDMMC_MCCAR_MAXCUR30V_Pos) /* (SDMMC_MCCAR) Get information via another method Position  */
#define SDMMC_MCCAR_MAXCUR30V_4MA             (SDMMC_MCCAR_MAXCUR30V_4MA_Val << SDMMC_MCCAR_MAXCUR30V_Pos) /* (SDMMC_MCCAR) 4mA Position  */
#define SDMMC_MCCAR_MAXCUR30V_8MA             (SDMMC_MCCAR_MAXCUR30V_8MA_Val << SDMMC_MCCAR_MAXCUR30V_Pos) /* (SDMMC_MCCAR) 8mA Position  */
#define SDMMC_MCCAR_MAXCUR30V_12MA            (SDMMC_MCCAR_MAXCUR30V_12MA_Val << SDMMC_MCCAR_MAXCUR30V_Pos) /* (SDMMC_MCCAR) 12mA Position  */
#define SDMMC_MCCAR_MAXCUR18V_Pos             _UINT32_(16)                                         /* (SDMMC_MCCAR) Maximum Current for 1.8V Position */
#define SDMMC_MCCAR_MAXCUR18V_Msk             (_UINT32_(0xFF) << SDMMC_MCCAR_MAXCUR18V_Pos)        /* (SDMMC_MCCAR) Maximum Current for 1.8V Mask */
#define SDMMC_MCCAR_MAXCUR18V(value)          (SDMMC_MCCAR_MAXCUR18V_Msk & (_UINT32_(value) << SDMMC_MCCAR_MAXCUR18V_Pos)) /* Assigment of value for MAXCUR18V in the SDMMC_MCCAR register */
#define   SDMMC_MCCAR_MAXCUR18V_OTHER_Val     _UINT32_(0x0)                                        /* (SDMMC_MCCAR) Get information via another method  */
#define   SDMMC_MCCAR_MAXCUR18V_4MA_Val       _UINT32_(0x1)                                        /* (SDMMC_MCCAR) 4mA  */
#define   SDMMC_MCCAR_MAXCUR18V_8MA_Val       _UINT32_(0x2)                                        /* (SDMMC_MCCAR) 8mA  */
#define   SDMMC_MCCAR_MAXCUR18V_12MA_Val      _UINT32_(0x3)                                        /* (SDMMC_MCCAR) 12mA  */
#define SDMMC_MCCAR_MAXCUR18V_OTHER           (SDMMC_MCCAR_MAXCUR18V_OTHER_Val << SDMMC_MCCAR_MAXCUR18V_Pos) /* (SDMMC_MCCAR) Get information via another method Position  */
#define SDMMC_MCCAR_MAXCUR18V_4MA             (SDMMC_MCCAR_MAXCUR18V_4MA_Val << SDMMC_MCCAR_MAXCUR18V_Pos) /* (SDMMC_MCCAR) 4mA Position  */
#define SDMMC_MCCAR_MAXCUR18V_8MA             (SDMMC_MCCAR_MAXCUR18V_8MA_Val << SDMMC_MCCAR_MAXCUR18V_Pos) /* (SDMMC_MCCAR) 8mA Position  */
#define SDMMC_MCCAR_MAXCUR18V_12MA            (SDMMC_MCCAR_MAXCUR18V_12MA_Val << SDMMC_MCCAR_MAXCUR18V_Pos) /* (SDMMC_MCCAR) 12mA Position  */
#define SDMMC_MCCAR_Msk                       _UINT32_(0x00FFFFFF)                                 /* (SDMMC_MCCAR) Register Mask  */


/* -------- SDMMC_FERACES : (SDMMC Offset: 0x50) ( /W 16) Force Event for Auto CMD Error Status -------- */
#define SDMMC_FERACES_RESETVALUE              _UINT16_(0x00)                                       /*  (SDMMC_FERACES) Force Event for Auto CMD Error Status  Reset Value */

